In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],columns = ["Column1","Column2","Column3"])

In [4]:
df

    Column1   Column2   Column3
A  0.795412 -1.099741  1.195828
B -0.371050  1.064358 -0.852529
C -0.704008  0.845074  0.026344
D -0.021306  0.514914  0.425659

In [5]:
df >-1

   Column1  Column2  Column3
A     True    False     True
B     True     True     True
C     True     True     True
D     True     True     True

In [6]:
df > 0

   Column1  Column2  Column3
A     True    False     True
B    False     True    False
C    False     True     True
D    False     True     True

In [7]:
booleanDF = df>0

In [8]:
booleanDF

   Column1  Column2  Column3
A     True    False     True
B    False     True    False
C    False     True     True
D    False     True     True

In [9]:
df[booleanDF]

    Column1   Column2   Column3
A  0.795412       NaN  1.195828
B       NaN  1.064358       NaN
C       NaN  0.845074  0.026344
D       NaN  0.514914  0.425659

In [11]:
df[df>-1]

    Column1   Column2   Column3
A  0.795412       NaN  1.195828
B -0.371050  1.064358 -0.852529
C -0.704008  0.845074  0.026344
D -0.021306  0.514914  0.425659

In [12]:
df

    Column1   Column2   Column3
A  0.795412 -1.099741  1.195828
B -0.371050  1.064358 -0.852529
C -0.704008  0.845074  0.026344
D -0.021306  0.514914  0.425659

In [13]:
df["Column1"]

A    0.795412
B   -0.371050
C   -0.704008
D   -0.021306
Name: Column1, dtype: float64

In [14]:
df["Column1"] >0

A     True
B    False
C    False
D    False
Name: Column1, dtype: bool

In [15]:
df[df["Column1"] > 0]

    Column1   Column2   Column3
A  0.795412 -1.099741  1.195828

In [16]:
df

    Column1   Column2   Column3
A  0.795412 -1.099741  1.195828
B -0.371050  1.064358 -0.852529
C -0.704008  0.845074  0.026344
D -0.021306  0.514914  0.425659

In [18]:
df["Column1"] > 0.5

A     True
B    False
C    False
D    False
Name: Column1, dtype: bool

In [19]:
df[df["Column1"] > 0.5]

    Column1   Column2   Column3
A  0.795412 -1.099741  1.195828

In [20]:
df[df["Column1"] > 0]

    Column1   Column2   Column3
A  0.795412 -1.099741  1.195828

In [21]:
df[df["Column2"] > 0]

    Column1   Column2   Column3
B -0.371050  1.064358 -0.852529
C -0.704008  0.845074  0.026344
D -0.021306  0.514914  0.425659

In [22]:
df[df["Column3"] > 0]

    Column1   Column2   Column3
A  0.795412 -1.099741  1.195828
C -0.704008  0.845074  0.026344
D -0.021306  0.514914  0.425659

In [23]:
df

    Column1   Column2   Column3
A  0.795412 -1.099741  1.195828
B -0.371050  1.064358 -0.852529
C -0.704008  0.845074  0.026344
D -0.021306  0.514914  0.425659

In [24]:
df["Column3"] > 0

A     True
B    False
C     True
D     True
Name: Column3, dtype: bool

In [25]:
df[(df["Column2"] > 0) & (df["Column3"] > 0)]

    Column1   Column2   Column3
C -0.704008  0.845074  0.026344
D -0.021306  0.514914  0.425659

In [26]:
df[(df["Column2"] > 0) | (df["Column3"] > 0)]

    Column1   Column2   Column3
A  0.795412 -1.099741  1.195828
B -0.371050  1.064358 -0.852529
C -0.704008  0.845074  0.026344
D -0.021306  0.514914  0.425659

In [27]:
#---------------

In [28]:
df

    Column1   Column2   Column3
A  0.795412 -1.099741  1.195828
B -0.371050  1.064358 -0.852529
C -0.704008  0.845074  0.026344
D -0.021306  0.514914  0.425659

In [31]:
df["Column4"] = pd.Series(randn(4),["A","B","C","D"])

In [32]:
df

    Column1   Column2   Column3   Column4
A  0.795412 -1.099741  1.195828 -1.016576
B -0.371050  1.064358 -0.852529 -1.508156
C -0.704008  0.845074  0.026344  1.096327
D -0.021306  0.514914  0.425659 -0.689918

In [35]:
randn(4,3)

array([[ 0.53339012, -0.33174817,  1.57639941],
       [ 0.43948152, -1.70336144, -1.32305885],
       [-3.18652098,  0.08469205, -0.70817243],
       [ 0.2917914 , -0.32435166, -0.90295813]])

In [36]:
df["Column5"] = randn(4)

In [37]:
df

    Column1   Column2   Column3   Column4   Column5
A  0.795412 -1.099741  1.195828 -1.016576 -1.121485
B -0.371050  1.064358 -0.852529 -1.508156  0.176208
C -0.704008  0.845074  0.026344  1.096327 -0.289997
D -0.021306  0.514914  0.425659 -0.689918  0.640077

In [39]:
df["Column6"] = ["newValue1","newValue2","newValue3","newValue4"]

In [40]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A  0.795412 -1.099741  1.195828 -1.016576 -1.121485  newValue1
B -0.371050  1.064358 -0.852529 -1.508156  0.176208  newValue2
C -0.704008  0.845074  0.026344  1.096327 -0.289997  newValue3
D -0.021306  0.514914  0.425659 -0.689918  0.640077  newValue4

In [41]:
df.set_index("Column6")

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  0.795412 -1.099741  1.195828 -1.016576 -1.121485
newValue2 -0.371050  1.064358 -0.852529 -1.508156  0.176208
newValue3 -0.704008  0.845074  0.026344  1.096327 -0.289997
newValue4 -0.021306  0.514914  0.425659 -0.689918  0.640077

In [42]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A  0.795412 -1.099741  1.195828 -1.016576 -1.121485  newValue1
B -0.371050  1.064358 -0.852529 -1.508156  0.176208  newValue2
C -0.704008  0.845074  0.026344  1.096327 -0.289997  newValue3
D -0.021306  0.514914  0.425659 -0.689918  0.640077  newValue4

In [43]:
df.set_index("Column6",inplace = True)

In [44]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  0.795412 -1.099741  1.195828 -1.016576 -1.121485
newValue2 -0.371050  1.064358 -0.852529 -1.508156  0.176208
newValue3 -0.704008  0.845074  0.026344  1.096327 -0.289997
newValue4 -0.021306  0.514914  0.425659 -0.689918  0.640077